#include "ds18b20.h"


void Delay_Us(uint32_t cnt)
{
    cnt = cnt;      //如果是2,50度以上会跳为0度，如果为4会读不出温度
    while (cnt--);      //16M的主频，延时要修改
}

void Delay_Ms(uint32_t cnt)
{
    cnt = cnt * 940;


    while (cnt--);
}

/*******************************************************************************
// 名称         : DS18B20_Rst
// 创建日期     : 2017-07-29
// 作者         : 梅梦醒
// 功能         : 复位DS18B20
// 输入参数     : 无
// 输出参数     : 无
// 返回结果     : 无
// 注意和说明   : 
// 修改内容     : 
********************************************************************************/
static void DS18B20_Rst(void)	   
{    
    DS18B20_IO_OUT;                                                      
    DS18B20_DQ_OUT_L;                                                  
    Delay_Us(490);                                                             
    DS18B20_DQ_OUT_H;                                                  
    Delay_Us(13);                                                           
}

/*******************************************************************************
// 名称         : DS18B20_Check
// 创建日期     : 2017-07-29
// 作者         : 梅梦醒
// 功能         : 检查DS18B20是否正常
// 输入参数     : 无
// 输出参数     : 无
// 返回结果     : 0-DS18B20正常；1-DS18B20异常
// 注意和说明   : 
// 修改内容     : 
********************************************************************************/	
static uint8_t DS18B20_Check(void) 	   
{   
    uint8_t retry = 0;
    
    DS18B20_IO_IN; 
    //__disable_irq(); 
    while(DS18B20_DQ_IN_READ)                                         
    {
        if(retry++ >= 200)
        {
            //__enable_irq();                                                     //必须在这里开中断，否怎一旦发生这种情况无法通信
            return 1;
        }
        Delay_Us(1);
    }	

    retry = 0;
    
    while(!DS18B20_DQ_IN_READ)
    {
        if(retry++ >= 240)
        {
            //__enable_irq();
            return 1;
        }
        Delay_Us(1);
    }
    //__enable_irq(); 
    return 0;
}





/*******************************************************************************
// 名称         : DS18B20_Read_Bit
// 创建日期     : 2017-07-29
// 作者         : 梅梦醒
// 功能         : 读一个位数据
// 输入参数     : 无
// 输出参数     : 无
// 返回结果     : 读出的位
// 注意和说明   : 
// 修改内容     : 
********************************************************************************/
static uint8_t DS18B20_Read_Bit(void) 			 
{
    uint8_t data;

    DS18B20_IO_OUT;
    
    DS18B20_DQ_OUT_L;
    
    Delay_Us(1);
    
    DS18B20_DQ_OUT_H;
    Delay_Us(1);
    DS18B20_IO_IN;
    
    Delay_Us(6);
    
    if(DS18B20_DQ_IN_READ)
    {
        data = 1;
    }
    else 
    {
        data = 0;
    }
    Delay_Us(63);
    
    return data;
}

/*******************************************************************************
// 名称         : DS18B20_Read_Byte
// 创建日期     : 2017-07-29
// 作者         : 梅梦醒
// 功能         : 从DS18B20读一个字节数据
// 输入参数     : 无
// 输出参数     : 无
// 返回结果     : 读出的一个字节数据
// 注意和说明   : 
// 修改内容     : 
********************************************************************************/
static uint8_t DS18B20_Read_Byte(void)     
{   
    uint8_t i,j,dat;
    dat = 0;
    //__disable_irq();            //读写时关闭中断，防止读数错误
    for (i = 1; i <= 8; i++)            
    {
        j = DS18B20_Read_Bit();
        dat = (j << 7) | (dat >> 1);
    }
    //__enable_irq(); 
    return dat;
}


/*******************************************************************************
// 名称         : DS18B20_Write_Byte
// 创建日期     : 2017-07-29
// 作者         : 梅梦醒
// 功能         : 写一个字节数据到DS18B20
// 输入参数     : u8 dat    写入的数据
// 输出参数     : 无
// 返回结果     : 无
// 注意和说明   : 
// 修改内容     : 
********************************************************************************/
static void DS18B20_Write_Byte(uint8_t dat)     
 {   
    uint8_t j;
    uint8_t testb;
    DS18B20_IO_OUT;
    //__disable_irq();
    for(j=1; j<=8; j++) 
    {
        testb = dat & 0x01;
        dat = dat >> 1;
        if(testb) 
        {
            DS18B20_DQ_OUT_L;
            Delay_Us(3);
            DS18B20_DQ_OUT_H;
            Delay_Us(65);             
        }
        else 
        {
            DS18B20_DQ_OUT_L;
            Delay_Us(65);             
            DS18B20_DQ_OUT_H;
            Delay_Us(3);
        }
    }
    //__enable_irq();
}
 

/*******************************************************************************
// 名称         : DS18B20_Start
// 创建日期     : 2017-07-29
// 作者         : 梅梦醒
// 功能         : 通知DS18B20跳过ROM开始温度转化
// 输入参数     : 无
// 输出参数     : 无
// 返回结果     : 无
// 注意和说明   : 
// 修改内容     : 
********************************************************************************/
void DS18B20_Start(void)
{   						               
    DS18B20_Rst();	   
    DS18B20_Check();	 
    DS18B20_Write_Byte(0xCC);   //跳过ROM
    DS18B20_Write_Byte(0x44);   //开始转换
} 




/*******************************************************************************
// 名称         : DS18B20_Init
// 创建日期     : 2017-07-29
// 作者         : 梅梦醒
// 功能         : 初始化对应的通道
// 输入参数     : 
// 输出参数     : 无
// 返回结果     : 
// 注意和说明   : 
// 修改内容     : 
********************************************************************************/	 
void DS18B20_Init(void)
{ 
    DS18B20_PORT->MODER &= 0xFFF3FFFF;            
    DS18B20_PORT->MODER |= 0x00040000;           //PA9通用输出模式
    DS18B20_PORT->OTYPER &= ~(1<<9);             //推挽输出
    DS18B20_PORT->OSPEEDR |= (3<<18);            //高速  
    DS18B20_PORT->PUPDR &= 0xFFF3FFFF;           //上拉
    DS18B20_PORT->PUPDR |= 0x00040000;  
    DS18B20_PORT->BRR = DS18B20_PIN;            //拉低再拉高，出现故障时复位一下总线
    Delay_Us(10000);
    DS18B20_PORT->BSRR = DS18B20_PIN;
}



#include "usart.h"
/*******************************************************************************
// 名称         : DS18B20_Get_Temp
// 创建日期     : 2017-07-29
// 作者         : 梅梦醒
// 功能         : 从ds18b20得到温度值
// 输入参数     : u8 Channe         通道号
// 输出参数     : 无
// 返回结果     : 温度值 （-550~1250）
// 注意和说明   : 
// 修改内容     : 
********************************************************************************/
int DS18B20_Get_Temp(void)
{
    uint8_t sta;
    uint8_t temp;
    uint8_t TL,TH;

    int temperature;
    short tem;
    
    DS18B20_Start();
    Delay_Us(80);
    DS18B20_Rst();
    sta = DS18B20_Check();
    if(sta)                                                                     //没有查询到传感器
        return -27310000;
    DS18B20_Write_Byte(0xCC);
    DS18B20_Write_Byte(0xBE);    
    TL = DS18B20_Read_Byte(); 
    TH = DS18B20_Read_Byte(); 
    if(TH > 7)
    {
        TH = ~TH;
        TL = ~TL; 
        temp = 0;                                                               //温度为负  
    }
    else 
    {
        temp = 1;
    }                                                                           //温度为正
    tem = TH;                                                                   //获得高八位
    tem <<= 8;    
    tem += TL;                                                                  //获得低八位    
    
    temperature = (int)(tem * 6250);                                            //转换，用小数会增加flash开销     
    if(temp)
    {
        return temperature;                                                     //返回温度值
    }
    else 
    {
        return -temperature; 
    }
}
